# 损失生命
# 受到伤害或者我方技能消耗生命都算在内

@创建事件 损失生命 begin

    数值::Int
    下降前的生命值::Int
    下降后的生命值::Int

    function 损失生命(战场::战场, 指向, 数值::Int; 性质::Array{标签.性质}=[])
        new(战场, 性质, 指向.first, 指向.second, 数值, 指向.second.生命, 指向.second.生命 - 数值)
    end

end

@触发事件 begin
    事件.目标.生命 -= 事件.数值
    控制台换行("$事件")
    if 事件.目标.生命.当前 <= 0
        @即将陷入无法战斗状态
    end
end

Base.show(io::IO, 事件::损失生命) = print(io, "【$(事件.目标)】生命值下降 $(事件.数值 / 10.0) 点，剩余生命值 $(事件.目标.生命.当前 / 10.0) 点。")

# 将当前事件的目标扣减生命
macro 扣减生命(说明::Expr)
    数值 = 提取字段(:数值, 说明)
    quote
        $(esc(:触发))(损失生命(
            $(esc(:事件)).战场,
            $(esc(:事件)).来源 => $(esc(:事件)).目标,
            $(esc(数值)), 性质 = $(esc(:事件)).性质列表))
    end
end

# 将当前事件的来源扣减生命
macro 消耗生命(说明::Expr)
    数值 = 提取字段(:数值, 说明)
    quote
        $(esc(:触发))(损失生命(
            $(esc(:事件)).战场,
            $(esc(:事件)).来源 => $(esc(:事件)).来源,
            $(esc(数值)), 性质 = $(esc(:事件)).性质列表))
    end
end