# 造成削韧

@创建事件 造成削韧 begin

    数值::Int
    属性::标签.属性

    下降前的韧性值::Int
    下降后的韧性值::Int

    function 造成削韧(战场::战场, 指向, 数值::Int; 性质::Vector{标签.性质}=[])
        来源 = 指向[1]
        目标 = 指向[2]
        new(战场, 性质, 来源, 目标, 数值, 来源.模板.属性, 目标.韧性, 目标.韧性 - 数值)
    end

end

@触发事件 begin
    事件.目标.韧性.当前 = max(0, 事件.下降后的韧性值)
    if 事件.目标.韧性.当前 == 0
        @击破目标
    end
end

# 简单削韧效果
macro 削韧目标(说明::Expr)
    数值 = 提取字段(:数值, 说明)
    目标 = 提取字段(:目标, 说明, 默认值 = :(事件.目标))
    quote
       $(esc(:触发))(造成削韧(
            $(esc(:事件)).战场,
            $(esc(:事件)).来源 => $(esc(目标)),
            $(esc(数值)), 性质 = $(esc(:事件)).性质列表))
    end
end

# 攻击并削韧
macro 攻击并削韧(说明::Expr)
    威力 = 提取字段(:威力, 说明)
    削韧 = 提取字段(:削韧, 说明)
    目标 = 提取字段(:目标, 说明, 默认值 = :(事件.目标))
    quote
        @攻击目标 begin
            威力 = $(esc(威力))
            目标 = $(esc(目标))
        end
        @削韧目标 begin
            数值 = $(esc(削韧))
            目标 = $(esc(目标))
        end
    end
end