# 定义了一些标签作为枚举类型

module 标签

@enum 命途 毁灭 同谐 丰饶 巡猎 存护 智识 虚无
@enum 属性 物理 火 冰 风 雷 量子 虚数
@enum 队伍 蓝方 红方 中立
@enum 性质 普攻 战技 被动 终结技 追加攻击 单体攻击 扩散攻击 随机攻击 全体攻击 击破伤害 持续伤害 裂伤伤害 灼烧伤害 触电伤害 风化伤害 冻结伤害
@enum 触发时机 进入战斗时 回合开始时 回合结束时 击破弱点时 消灭时 无法战斗时 攻击开始时 攻击结束时 技能开始时 技能结束时

export 毁灭, 同谐, 丰饶, 巡猎, 存护, 智识, 虚无
export 物理, 火, 冰, 风, 雷, 量子, 虚数
export 蓝方, 红方, 中立
export 普攻, 战技, 被动, 终结技, 追加攻击, 单体攻击, 扩散攻击, 随机攻击, 全体攻击, 击破伤害, 持续伤害, 裂伤, 灼烧, 触电, 风化, 冻结
export 进入战斗时, 回合开始时, 回合结束时, 击破弱点时, 消灭时, 无法战斗时, 攻击开始时, 攻击结束时, 技能开始时, 技能结束时

end

Base.show(io::IO, x::标签.命途) = print(io, x)
Base.show(io::IO, x::标签.属性) = print(io, Dict(
    物理 => (@灰 "物理"),
    火 => (@红 "火"),
    冰 => (@青 "冰"),
    风 => (@绿 "风"),
    雷 => (@紫 "雷"),
    量子 => (@蓝 "量子"),
    虚数 => (@黄 "虚数")
)[x])
Base.show(io::IO, x::标签.队伍) = print(io, Dict(
    蓝方 => (@蓝 "蓝方"),
    红方 => (@红 "红方"),
    中立 => (@灰 "中立")
)[x])
Base.show(io::IO, x::标签.性质) = print(io, x)
Base.show(io::IO, x::标签.触发时机) = print(io, x)